In [2]:
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv('titanic.csv')
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [6]:
cols = ['Survived', 'Pclass', 'Sex', 'Age']
df = pd.read_csv('titanic.csv', usecols=cols)
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [7]:
df.shape

(887, 4)

In [8]:
df.describe()

         Survived      Pclass         Age
count  887.000000  887.000000  887.000000
mean     0.385569    2.305524   29.471443
std      0.487004    0.836662   14.121908
min      0.000000    1.000000    0.420000
25%      0.000000    2.000000   20.250000
50%      0.000000    3.000000   28.000000
75%      1.000000    3.000000   38.000000
max      1.000000    3.000000   80.000000

In [10]:
df.Survived.value_counts()

0    545
1    342
Name: Survived, dtype: int64

In [11]:
df.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
dtype: object

In [13]:
df = pd.read_csv('titanic.csv', usecols=cols)
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [16]:
df.isna().any()

Survived    False
Pclass      False
Sex         False
Age         False
dtype: bool

In [15]:
df.isna()

     Survived  Pclass    Sex    Age
0       False   False  False  False
1       False   False  False  False
2       False   False  False  False
3       False   False  False  False
4       False   False  False  False
..        ...     ...    ...    ...
882     False   False  False  False
883     False   False  False  False
884     False   False  False  False
885     False   False  False  False
886     False   False  False  False

[887 rows x 4 columns]

In [17]:
df.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
dtype: int64

In [18]:
df.isna().sum().sum()

0